{
  "Proyecto": "Gestor de Tareas",
  "Objetivos": {
    "Principales": [
      "Permitir al usuario crear, editar, eliminar y marcar o desmarcar tareas como finalizadas.",
      "Almacenar las tareas de forma local para garantizar la persistencia de los datos sin necesidad de conexión externa."
    ],
    "Futuros": [
      "Implementar registro e inicio de sesión de usuarios para gestionar tareas individuales y perfiles.",
      "Añadir cronometraje de inicio y fin de tarea para medir el tiempo dedicado y almacenar la información de cada sesión de trabajo.",
      "Incorporar roles de usuario (por ejemplo, administrador) que permitan asignar tareas a otros usuarios."
    ]
  },
  "Stakeholders": {
    "Primarios": [
      "Usuario final (gestiona sus propias tareas)."
    ],
    "Secundarios": [
      "Administrador (asigna tareas a usuarios en fases futuras).",
      "Equipo de desarrollo (implementa las funcionalidades del sistema)."
    ]
  },
  "Alcance": {
    "MVP": {
      "Funcionalidades": [
        "Crear nuevas tareas.",
        "Editar tareas existentes.",
        "Eliminar tareas.",
        "Marcar y desmarcar tareas como finalizadas.",
        "Persistir los datos en una base de datos local."
      ],
      "Limitaciones": [
        "Sin autenticación de usuarios.",
        "Sin control de tiempo de tareas.",
        "Sin gestión de roles o permisos."
      ]
    },
    "Futuras Iteraciones": {
      "Funcionalidades Previstas": [
        "Sistema de autenticación y gestión de perfiles de usuario.",
        "Cronometrado de tareas (inicio/fin y sesiones de trabajo).",
        "Roles de usuario con permisos diferenciados (usuario, administrador).",
        "Asignación de tareas por parte de administradores."
      ]
    }
  },
  "RequisitosNoFuncionales": {
    "Rendimiento": [
      "La aplicación debe cargar y mostrar la lista de tareas en menos de 2 segundos con datos locales.",
      "Las operaciones CRUD deben ejecutarse de forma instantánea sin necesidad de recargar la página."
    ],
    "Seguridad": [
      "Los datos locales deben almacenarse de manera que no se corrompan por cierres inesperados de la aplicación.",
      "Cuando se implemente la autenticación, las credenciales deben manejarse mediante cifrado y sesiones seguras."
    ],
    "Usabilidad": [
      "La interfaz debe ser clara y minimalista, facilitando el acceso a las acciones básicas (crear, editar, eliminar, marcar tareas).",
      "El flujo de uso debe permitir gestionar tareas con el menor número de clics posible.",
      "En futuras versiones, el usuario debe poder visualizar su historial de trabajo y tiempos invertidos de forma intuitiva."
    ],
    "Escalabilidad": [
      "La arquitectura debe permitir la futura integración de un sistema de usuarios y roles sin reestructurar el núcleo del proyecto.",
      "El almacenamiento local debe poder migrarse fácilmente a una base de datos remota (por ejemplo, MongoDB o PostgreSQL)."
    ]
  }
}
